In [43]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [44]:
import pandas as pd

In [45]:
df = pd.DataFrame(people)

In [46]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [47]:
df['first'] + ' ' + df['last'] #kolonları aralarında bir boşluk olacak şekilde yazıyoruz.

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [48]:
df['full_name'] = df['first'] + ' ' + df['last'] #yazdığımız bir boşluk olan isim soyismi full_name kolonuna atıyoruz.

In [49]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [50]:
df.drop(columns=['first', 'last'], inplace=True) #firt ve last kolonunu kalıcı olarak siliyoruz.

In [51]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [52]:
df['full_name'].str.split(' ', expand=True) #full_name sütununu boşluk ile ayırıyoruz.ayırma sonrası expand ile ayırma sonucu oluşan liste öğeleri yeni sütunlara yerleştirilir

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [53]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True) #ayırdığımız ve yerleşim yapığımız değerleri first ve last sütununa ekliyorz

In [54]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [55]:
df.loc[len(df)] = {'first': 'Tony'}

In [56]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [57]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [58]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [59]:
df = pd.concat([df, df2], ignore_index=True) #iki dataframe i birleştiriyoruz. index numaralarını önemsemeden tek ve ardışık 
#şekilde tekrar yazıyor.

In [60]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [61]:
df.drop(index=3) #index numarası 3 olan satırı siliyoruz.

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers

In [62]:
filt = df['last'] == 'Doe'  #last sütunundaki Doe ismine eşit olanı filtreliyoruz
df.drop(index=df[filt].index) #filtrelediğimizi siliyoruz yani bu örneğe göre (1 ve 2 numaralı index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3                      NaN            NaN   Tony      NaN
4       IronMan@avenge.com            NaN   Tony    Stark
5           Cap@avenge.com            NaN  Steve   Rogers